Config/DataProcessors/ОбменССистемойУчетаИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбменССистемойУчетаИмущества</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/СостояниеОбъектовУчетаРеестраИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеОбъектовУчетаРеестраИмущества</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКартРеестраИмущества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектУчетаИмущества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыУчетаСистемыУчетаИмущества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СведенияРеестровогоУчетаИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СведенияРеестровогоУчетаИмущества</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РеестровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СистемныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектУчетаИмущества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыУчетаСистемыУчетаИмущества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СостояниеКартРеестраИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеКартРеестраИмущества</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКартРеестраИмущества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияСведенийОбИмуществе</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/ЗаданиеНаЭкспортДанныхВБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаданиеНаЭкспортДанныхВБанкиКС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияОбменаБанкиКС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбмена</Name>
					<Comment>Вид обмена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Comment>Дата окончания периода выборки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Comment>Дата начала периода выборки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФорматов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаФорматовОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЕдиногоФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаВыгрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Comment>Формат выгрузки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФорматыОбменаБанкиКС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Comment>Объект экспорта</Comment>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветWebСервиса</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗаданиеНаЭкспортДанныхВБанкиКСПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПроизвольныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/РегистрацияСведенийОбИмуществе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РегистрацияСведенийОбИмуществе</Name>
			<BasedOn>
				<xr:Item>Document.РегистрацияСведенийОбИмуществе</xr:Item>
				<xr:Item>Catalog.ОбъектыУчетаСистемыУчетаИмущества</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияОбОбъектеИмущества</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчетаИмущества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыУчетаСистемыУчетаИмущества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияСведенийОбИмуществе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитСведений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РеквизитыСведенийОбИмуществе</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ТипыРеквизитовСведенийОбИмуществе</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/НастройкиОбменаСистемаУчетаИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиОбменаСистемаУчетаИмущества</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отбор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборПодбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкаОбмена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиОбменаБанкиКС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ОбъектыУчетаСистемыУчетаИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбъектыУчетаСистемыУчетаИмущества</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектУчетаИмущества</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКартСведенийОбИмуществе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ОбменССистемойУчетаИмущества/Forms/Форма/Ext/Form/Module.bsl
// Переменные для работы обработки в фоновом режиме
&НаКлиенте
Перем ПараметрыОбработчикаОжидания, ФормаДлительнойОперации, ТекущаяОперация, Цвета;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	УстановитьНастройки();
	
	Организация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
	ОрганизацияПриИзмененииСервер();
	
	ЗагрузкаОтборПредставление = "Отбор: не установлен";
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНадписи();
	ПроверкаВыбранногоДействия();
	
	ТолькоНеподтвержденныеРедакцииКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "Документ.ЗаданиеНаЭкспортДанныхВБанкиКС.ФормаВыбора" Тогда
		ОткрытьФормуРезультата(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.НастройкиОбменаСистемаУчетаИмущества.Форма.ФормаВыбора" Тогда
		НастройкаОбмена = ВыбранноеЗначение;
		ОбновитьНадписи();
		УстановитьНастройки();
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаНастройкиОтбора" Тогда
		ЗагрузкаОтбор = ВыбранноеЗначение.НастройкиОтбора;
		ЗагрузкаОтборПредставление = ВыбранноеЗначение.ПредставлениеОтбора;
		ЗагрузкаОтборПредставление = "Отбор: " + ?(ЗначениеЗаполнено(ЗагрузкаОтборПредставление), ЗагрузкаОтборПредставление, "не установлен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗагрузкаКартИзАСУФИ" Тогда
		// Позволяет получить данные карт, вычисленные другим путем
		АдресХранилища = Параметр;
		ВывестиПолученныеДанные();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(НастройкаОбмена) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указана настройка обмена.'"),,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
		
	ОрганизацияПриИзмененииСервер();
	//ОбновитьНадписи();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОбменаНажатие(Элемент, СтандартнаяОбработка = Истина)

	СтандартнаяОбработка = Ложь;

	ПараметрыФормы = Новый Структура("ТекущаяСтрока", НастройкаОбмена);
	ОткрытьФорму("Справочник.НастройкиОбменаСистемаУчетаИмущества.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыОбмена

&НаКлиенте
Процедура ДокументыОбменаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ОбъектУчетаИмущества = Элемент.ТекущиеДанные.ОбъектУчетаИмущества;
	Документ = ПолучитьПоследнююРедакцию(ОбъектУчетаИмущества);
	
	Если Не Документ.Пустая() Тогда
		ПоказатьЗначение(,Документ); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоследнююРедакцию(ОбъектУчетаИмущества)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РегистрацияСведенийОбИмуществе.Ссылка
	               |ИЗ
	               |	Документ.РегистрацияСведенийОбИмуществе КАК РегистрацияСведенийОбИмуществе
	               |ГДЕ
	               |	РегистрацияСведенийОбИмуществе.ОбъектУчетаИмущества = &Объект
	               |	И НЕ РегистрацияСведенийОбИмуществе.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РегистрацияСведенийОбИмуществе.Дата УБЫВ";
				   
	Запрос.УстановитьПараметр("Объект", ОбъектУчетаИмущества);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Документы.РегистрацияСведенийОбИмуществе.ПустаяСсылка());	
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	ИзменитьФлажки(Ложь)

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	
	ИзменитьФлажки(Истина)
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьСписокДокументов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ВыполнитьДлительнуюОперацию("ОбменДанными");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	ПараметрыФормы = Новый Структура("НачалоПериода, КонецПериода", Период.ДатаНачала, Период.ДатаОкончания);
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Период.ДатаНачала = РезультатВыбора.НачалоПериода;
		Период.ДатаОкончания = РезультатВыбора.КонецПериода;
		Элементы.УстановитьПериод.Заголовок = ПредставлениеПериода(Период.ДатаНачала, Период.ДатаОкончания);
		ЗаполнитьСписокДокументов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРезультат(Команда)
	
	Отбор = ПолучитьПараметрыНастройкиОбмена(НастройкаОбмена);
	Отбор.Вставить("Организация", Организация);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Документ.ЗаданиеНаЭкспортДанныхВБанкиКС.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКартПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьДанныеКартыДляПросмотра();

КонецПроцедуры

&НаКлиенте
Процедура СменитьСтраницу(Команда)
	
	Если Команда.Имя = "СменитьСтраницуЗагрузка" Тогда
		
		Элементы.КнопкаСтраницаЗагрузка.Пометка = Истина;
		Элементы.КнопкаСтраницаВыгрузка.Пометка = Ложь;
		Элементы.СтраницыОбмена.ТекущаяСтраница = Элементы.СтраницыОбмена.ПодчиненныеЭлементы.СтраницаЗагрузка;
		
	ИначеЕсли Команда.Имя = "СменитьСтраницуВыгрузка" Тогда
		
		Элементы.КнопкаСтраницаЗагрузка.Пометка = Ложь;
		Элементы.КнопкаСтраницаВыгрузка.Пометка = Истина;
		Элементы.СтраницыОбмена.ТекущаяСтраница = Элементы.СтраницыОбмена.ПодчиненныеЭлементы.СтраницаВыгрузка;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	ЧастиВопроса = Новый Массив;
	ЧастиВопроса.Добавить(НСтр("ru = 'Будет выполнена загрузка '"));
	Если КоличествоЗагружаемыхКарт = 0 Тогда
		ЧастиВопроса.Добавить("карт");
	Иначе
		ЧастиВопроса.Добавить(Новый ФорматированнаяСтрока(Строка(КоличествоЗагружаемыхКарт), Новый Шрифт(,, Истина)));
		ЧастиВопроса.Добавить(?(КоличествоЗагружаемыхКарт = 1, НСтр("ru = ' карты'"), НСтр("ru = ' карт'")));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗагрузкаОтбор) Тогда
		ЧастиВопроса.Добавить(?(КоличествоЗагружаемыхКарт = 1, НСтр("ru = ', удовлетворяющей'"), НСтр("ru = ', удовлетворяющих'")));
		ЧастиВопроса.Добавить(НСтр("ru = ' условию:'") + Символы.ПС);
		ЧастиВопроса.Добавить(Новый ФорматированнаяСтрока(Сред(ЗагрузкаОтборПредставление, 8),, Цвета.ПоясняющийТекст));
		ЧастиВопроса.Добавить(Символы.ПС);
	КонецЕсли;	
	
	Если ДанныеКарт.Количество() > 0 Тогда
		Если Не ЗначениеЗаполнено(ЗагрузкаОтбор) Тогда
			ЧастиВопроса.Добавить(Символы.ПС);
		КонецЕсли;
		ЧастиВопроса.Добавить(Символы.ПС);
		ТекстПредупреждение = НСтр("ru = 'Таблица ""Сведения карт"" не пустая! Таблица будет очищена'");		
		ЧастиВопроса.Добавить(Новый ФорматированнаяСтрока(ТекстПредупреждение,, Цвета.ПоясняющийОшибкуТекст));
		ЧастиВопроса.Добавить(Символы.ПС);
	КонецЕсли;
	
	ЧастиВопроса.Добавить(Символы.ПС + НСтр("ru = 'Продолжить?'"));
	
	ТекстВопроса = Новый ФорматированнаяСтрока(ЧастиВопроса); 
	
	ПараметрыВопроса = Новый Структура("Операция", "ЗагрузитьДанные");
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаВыполненияДлительнойОперации", ЭтотОбъект, ПараметрыВопроса);	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКарты(Команда)
	
	ВыбранныеКарты = ДанныеКарт.НайтиСтроки(Новый Структура("Пометка", Истина));
	
	Если ВыбранныеКарты.Количество() > 0 Тогда		
		ПараметрыВопроса = Новый Структура("Операция", "СоздатьКарты");
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаВыполненияДлительнойОперации", ЭтотОбъект, ПараметрыВопроса);
		ТекстВопроса = НСтр("ru = 'Выбранные карты буду созданы. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе		
		ПоказатьПредупреждение(,НСтр("ru = 'Не выбрано ни одной карты для создания!'"));		
	КонецЕсли;
	
	//ВыполнитьДлительнуюОперацию("СоздатьКарты");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСправочники(Команда)
	
	ВыполнитьДлительнуюОперацию("ЗагрузитьСправочники");

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсеСтатусы(Команда)
	
	ВыполнитьДлительнуюОперацию("ОбновитьВсеСтатусы");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаВыполненияДлительнойОперации(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
        ВыполнитьДлительнуюОперацию(Параметры.Операция);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаОтборПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СостояниеОбъектовУчетаРеестраИмущества.Период,
	               |	СостояниеОбъектовУчетаРеестраИмущества.ОбъектУчетаИмущества.ВидКарты КАК ВидКарты,
	               |	СостояниеОбъектовУчетаРеестраИмущества.Статус,
	               |	СостояниеОбъектовУчетаРеестраИмущества.ОбъектУчетаИмущества.Идентификатор КАК Идентификатор,
	               |	ИСТИНА КАК Отсутствует
	               |ИЗ
	               |	РегистрСведений.СостояниеОбъектовУчетаРеестраИмущества КАК СостояниеОбъектовУчетаРеестраИмущества";					   
	
	ПараметрыФормы = Новый Структура("ТекстЗапроса, НастройкиОтбора", ТекстЗапроса, ЗагрузкаОтбор);		
	ОткрытьФорму("ОбщаяФорма.ФормаНастройкиОтбора", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ ИНФОРМАЦИОННЫЙ ЦЕНТР

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Действующая редакция документа в таблице редакций карт
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВерсииКарт");
		
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВерсииКарт.ЭтоДействующаяРедакция");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,, Истина));
	
	
	// Не выбранные объекты учета для обмена в таблице Обмен
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДокументыОбмена");
		
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокументыОбмена.Пометка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	
	// Раскраска фона объекта учета имущества в таблице первоначальной загрузки объектов
	// Полностью не заполненный
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДанныеКартОбъектУчетаИмущества");
		
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеКарт.ОбъектУчетаИмущества");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеКарт.ОбъектУчета");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветЗаполняемогоПоказателя);
	
	// С заполненым объектом учета
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДанныеКартОбъектУчетаИмущества");
		
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеКарт.ОбъектУчетаИмущества");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеКарт.ОбъектУчета");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаУдачнойОтправки);
	
	
	// Раскраска статусов
	Справочники.СтатусыКартРеестраИмущества.УстановитьЦветПоСтатусу(УсловноеОформление,, "ОбъектыУчета.Статус", "ОбъектыУчетаСтатус"); 
	Справочники.СтатусыКартРеестраИмущества.УстановитьЦветПоСтатусу(УсловноеОформление,, "ВерсииКарт.Статус", "ВерсииКартСтатус");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройки()
	
	Если Не ЗначениеЗаполнено(НастройкаОбмена) Тогда
		
		Запрос = Новый Запрос;
		
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Настройки.Ссылка
		               |ИЗ
		               |	Справочник.НастройкиОбменаСистемаУчетаИмущества КАК Настройки
		               |ГДЕ
		               |	НЕ Настройки.ПометкаУдаления
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Настройки.Основная УБЫВ";
		
		Запрос.Текст = ТекстЗапроса;
		Настройки = Запрос.Выполнить().Выбрать();
		
		Если Настройки.Следующий() Тогда
			НастройкаОбмена = Настройки.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	СписокДействий.Очистить();
	Действия.Очистить();
	
	Для Каждого СтрокаДействия Из НастройкаОбмена.Действия Цикл
		
		Ключ = "СлужебноеПоле_КомандаОбмена_" + СтрокаДействия.НомерСтроки;
				
		СписокДействий.Добавить(Ключ, СтрокаДействия.Действие); 
		
		НовоеДействие = Действия.Добавить();
		НовоеДействие.Ключ				= Ключ;
		НовоеДействие.ВидОбмена			= НастройкаОбмена.ВидОбмена;
		НовоеДействие.НастройкаОбмена	= ?(ЗначениеЗаполнено(СтрокаДействия.НастройкаОбмена), СтрокаДействия.НастройкаОбмена, НастройкаОбмена.НастройкаОбмена);
		НовоеДействие.Отбор				= СтрокаДействия.Отбор;
		НовоеДействие.ОтборПодбора		= СтрокаДействия.ОтборПодбора;
		
	КонецЦикла;
	
	ЗаполнитьСписокДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписи()

	НастройкаОбменаУказана = ЗначениеЗаполнено(НастройкаОбмена);
	Элементы.НастройкаОбмена.Видимость			= НастройкаОбменаУказана;
	Элементы.НастройкаОбменаНеУказана.Видимость	= Не НастройкаОбменаУказана;
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаВыбранногоДействия()
	
	Если Элементы.ДействияСписок.ТекущаяСтрока <> Неопределено И Элементы.ДействияСписок.ТекущиеДанные.Значение <> ТекущееДействие Тогда
		ТекущееДействие = Элементы.ДействияСписок.ТекущиеДанные.Значение;
		ЗаполнитьСписокДокументов();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПроверкаВыбранногоДействия", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажки(Флаг)
	
	Для Каждого Строка Из ДокументыОбмена Цикл
		Строка.Пометка = Флаг;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытьФормуРезультата(Документ)
	
	ПараметрыФормы = Новый Структура("Документ", Документ);
	Форма = ОткрытьФорму("Обработка.ОбменВФорматахУФК_УФЭБС.Форма.РезультатОбмена", ПараметрыФормы, ЭтаФорма);
	
	Возврат Форма;
	
КонецФункции

&НаСервере
Процедура ОрганизацияПриИзмененииСервер()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОбъектыУчета, "Организация", Организация);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДокументов()
	
	НастройкаДействия = ПолучитьНастройкиДействия();
	Если НастройкаДействия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Таблица.Пометка,
	               |	Таблица.ОбъектУчетаИмущества
	               |ПОМЕСТИТЬ Таблица
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбъектыУчетаСистемыУчетаИмущества.Ссылка КАК ОбъектУчетаИмущества,
	               |	СостояниеКартРеестраИмущества.Статус КАК Статус,
	               |	СведенияРеестровогоУчетаИмущества.РеестровыйНомер,
	               |	СведенияРеестровогоУчетаИмущества.ДатаУчета,
	               |	СведенияРеестровогоУчетаИмущества.НомерКарты,
	               |	ЕСТЬNULL(Таблица.Пометка, ИСТИНА) КАК Пометка
	               |ПОМЕСТИТЬ ОсновнаяТаблица
	               |ИЗ
	               |	Справочник.ОбъектыУчетаСистемыУчетаИмущества КАК ОбъектыУчетаСистемыУчетаИмущества
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияРеестровогоУчетаИмущества КАК СведенияРеестровогоУчетаИмущества
	               |		ПО ОбъектыУчетаСистемыУчетаИмущества.Организация = СведенияРеестровогоУчетаИмущества.Организация
	               |			И ОбъектыУчетаСистемыУчетаИмущества.Ссылка = СведенияРеестровогоУчетаИмущества.ОбъектУчетаИмущества
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Таблица КАК Таблица
	               |		ПО ОбъектыУчетаСистемыУчетаИмущества.Ссылка = Таблица.ОбъектУчетаИмущества
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеКартРеестраИмущества КАК СостояниеКартРеестраИмущества
	               |		ПО (СостояниеКартРеестраИмущества.Карта В
	               |				(ВЫБРАТЬ ПЕРВЫЕ 1
	               |					ВТ.Карта
	               |				ИЗ
	               |					РегистрСведений.СостояниеКартРеестраИмущества КАК ВТ
	               |				ГДЕ
	               |					НЕ ВТ.Карта.ПометкаУдаления
	               |					И ВТ.Карта.ОбъектУчетаИмущества = ОбъектыУчетаСистемыУчетаИмущества.Ссылка
	               |				УПОРЯДОЧИТЬ ПО
	               |					ВТ.Карта.Дата УБЫВ))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОсновнаяТаблица.ОбъектУчетаИмущества КАК ОбъектУчетаИмущества,
	               |	ОсновнаяТаблица.РеестровыйНомер,
	               |	ОсновнаяТаблица.ДатаУчета,
	               |	ОсновнаяТаблица.НомерКарты,
	               |	ОсновнаяТаблица.Пометка,
	               |	ОсновнаяТаблица.Статус
	               |ИЗ
	               |	ОсновнаяТаблица КАК ОсновнаяТаблица";					  
				   
	Запрос = Новый Запрос;
	
	УсловиеДаты = "ВЫБРАТЬ
	              |	РегистрацияСведенийОбИмуществе.ОбъектУчетаИмущества КАК ОбъектУчетаИмущества
	              |ИЗ
	              |	Документ.РегистрацияСведенийОбИмуществе КАК РегистрацияСведенийОбИмуществе
	              |ГДЕ
	              |	РегистрацияСведенийОбИмуществе.Организация = &Организация
	              |	И НЕ РегистрацияСведенийОбИмуществе.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(Период.ДатаНачала) И ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		УсловиеДаты = УсловиеДаты + " И РегистрацияСведенийОбИмуществе.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
		Запрос.УстановитьПараметр("НачалоПериода",	Период.ДатаНачала);
		Запрос.УстановитьПараметр("КонецПериода",	Период.ДатаОкончания);		
	ИначеЕсли ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		УсловиеДаты = УсловиеДаты + "И РегистрацияСведенийОбИмуществе.Дата >= &НачалоПериода";
		Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	ИначеЕсли ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		УсловиеДаты = УсловиеДаты + "И РегистрацияСведенийОбИмуществе.Дата <= &КонецПериода";
		Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Иначе
		УсловиеДаты = "";
	КонецЕсли;
								  
	Запрос.Текст = ТекстЗапроса;
	Условие = РеестрИмуществаСервер.СкопироватьОтборКомпоновкиДанныхВЗапрос(Запрос, НастройкаДействия.ОтборПодбора);

	Если УсловиеДаты <> "" Тогда
		Запрос.Текст = Запрос.Текст + ?(Условие = "", " ГДЕ " , " И ") + "ОсновнаяТаблица.ОбъектУчетаИмущества В (" + УсловиеДаты + ")"; 	
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	               |УПОРЯДОЧИТЬ ПО
	               |	ОбъектУчетаИмущества";
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Таблица",	 ДокументыОбмена.Выгрузить());
		
	Результат = Запрос.Выполнить().Выгрузить();
	ДокументыОбмена.Загрузить(Результат);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиДействия()
	
	Если Не ЗначениеЗаполнено(НастройкаОбмена) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущееДействие) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДействиеКлюча = Действия.НайтиСтроки(Новый Структура("Ключ", ТекущееДействие));
	
	Если ДействиеКлюча.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДействиеКлюча[0];
	
КонецФункции

&НаКлиенте
Процедура ОткрытьДанныеКартыДляПросмотра()
	
	ТекущиеДанные = Элементы.ДанныеКарт.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекущиеДанные.ВидКарты) Тогда
		ТекстОповещения = НСтр("ru = 'Просмотр сведений карты'");
		Пояснение = НСтр("ru = 'Вид карты объекта учета имущества не определен, сведения не загружены.
								|Просмотр невозможен'");
		ПоказатьОповещениеПользователя(ТекстОповещения,, Пояснение);			
		Возврат;
	КонецЕсли;	
	
	ИсточникиДанных = ПолучитьИсточникиДанных(Элементы.ДанныеКарт.ТекущаяСтрока);
	ПараметрыФормы = Новый Структура("ВладелецРеквизитов,ИсточникиДанных,ДанныеОбъекта", ТекущиеДанные.ВидКарты, ИсточникиДанных, ТекущиеДанные.ЗначенияРеквизитов); 
		
	ОткрытьФорму("Справочник.РеквизитыСведенийОбИмуществе.Форма.ФормаДополнительная", ПараметрыФормы, ЭтаФорма);		
	
КонецПроцедуры
 
&НаСервере
Функция ПолучитьИсточникиДанных(ТекущаяСтрока)
	
	Данные = ДанныеКарт.НайтиПоИдентификатору(ТекущаяСтрока);
	
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.ОбъектУчетаИмущества = Данные.ОбъектУчетаИмущества;
	ДокументОбъект.ЗначенияРеквизитов.Загрузить(Данные.ЗначенияРеквизитов.Выгрузить());
	
	ЗаполнитьЗначенияСвойств(РеестровыйУчет, Данные);
	
	ИсточникиДанных = Новый Массив;
	ИсточникиДанных.Добавить(Новый Структура("ИмяИсточника,Источник,ТипИсточника", "Объект", ДокументОбъект, "ДокументОбъект.РегистрацияСведенийОбИмуществе"));
	ИсточникиДанных.Добавить(Новый Структура("ИмяИсточника,Источник,ТипИсточника", "РеестровыйУчет", РеестровыйУчет, "РегистрСведенийМенеджерЗаписи.СведенияРеестровогоУчетаИмущества"));
	
	Возврат ИсточникиДанных;
	
КонецФункции

//////////////////////////////

&НаКлиенте
Процедура ВыполнитьДлительнуюОперацию(Операция, ДопПараметры = Неопределено)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
			
	ЗаданиеВыполнено = ВыполнитьДлительнуюОперациюСервер(Операция, ДопПараметры);	
	Если ЗаданиеВыполнено Тогда
		ВыполнитьПоЗавершениюДлительнойОперации(Операция);
	Иначе
		ТекущаяОперация = Операция;
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьДлительнуюОперациюСервер(Операция, ДопПараметры)
	
	// Подготовка параметров запуска процедуры
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);	
	
	Если Операция = "ОбменДанными" Тогда
		НастройкаДействия = ПолучитьНастройкиДействия();
		Если НастройкаДействия = Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
		ПараметрыОбработки = Новый Структура("ВидОбмена,НастройкаОбмена,Отбор");
		ЗаполнитьЗначенияСвойств(ПараметрыОбработки, НастройкаДействия);
	Иначе
		ПараметрыОбработки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаОбмена, "ВидОбмена,НастройкаОбмена");
	КонецЕсли;
	
	ПараметрыОбработки.Вставить("Организация", Организация);	
	
	Если Операция = "ОбменДанными" Тогда
		
		ОбъектыУчетаИмущества = ДокументыОбмена.Выгрузить(Новый Структура("Пометка", Истина), "ОбъектУчетаИмущества").ВыгрузитьКолонку("ОбъектУчетаИмущества");
		ПараметрыОбработки.Вставить("ОбъектыУчетаИмущества", ОбъектыУчетаИмущества);
	
	ИначеЕсли Операция = "ЗагрузитьДанные" Тогда
			
		ТаблицаДанныеКарт = РеквизитФормыВЗначение("ДанныеКарт");
		ТаблицаДанныеКарт.Очистить();
		ПараметрыОбработки.Вставить("ДанныеКарт",	ТаблицаДанныеКарт);
		ПараметрыОбработки.Вставить("Отбор",		ЗагрузкаОтбор);
		ПараметрыОбработки.Вставить("Количество",	КоличествоЗагружаемыхКарт);
		
	ИначеЕсли Операция = "СоздатьКарты" Тогда
		
		ТаблицаДанныеКарт = РеквизитФормыВЗначение("ДанныеКарт");
		ТаблицаДанныеКарт = ТаблицаДанныеКарт.Скопировать(Новый Структура("Пометка", Истина),
			"ОбъектУчетаИмущества,Статус,ДатаСтатуса,СистемныйНомер,НомерКарты,РеестровыйНомер,ДатаУчета,ЗначенияРеквизитов");
		
		Если ТаблицаДанныеКарт.Количество() = 0 Тогда
			Возврат Истина;
		КонецЕсли;
		
		ПараметрыОбработки = Новый Структура;
		ПараметрыОбработки.Вставить("Организация", Организация);
		ПараметрыОбработки.Вставить("ДанныеКарт", ТаблицаДанныеКарт);
		
	ИначеЕсли Операция = "ЗагрузитьСправочники" Тогда
		//
		
	ИначеЕсли Операция = "ОбновитьСтатусыЗапросов" Тогда
		
		//ПараметрыОбработки.Вставить("Документы", ОбщегоНазначенияБГУ.Массив(Элементы.ВерсииКарт.ТекущаяСтрока.Ссылка));
		//Операция = "ОбновитьСтатусы";
		
	ИначеЕсли Операция = "ОбновитьВсеСтатусы" Тогда
		
		//ПараметрыОбработки.Вставить("Документы", ОбщегоНазначенияБГУ.Массив(Документы.РегистрацияСведенийОбИмуществе.ПустаяСсылка()));

	КонецЕсли;
	
	Если ДопПараметры <> Неопределено Тогда
		Для Каждого ДопПараметр Из ДопПараметры Цикл
			ПараметрыОбработки.Вставить(ДопПараметр.Ключ, ДопПараметр.Значение);
		КонецЦикла;
	КонецЕсли;
	
	// Запуск в зависимости от режима работы
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда	
		Обработки.ОбменССистемойУчетаИмущества.ВыполнитьОперацию(Операция, ПараметрыОбработки, АдресХранилища);
		Возврат Истина;		
	КонецЕсли;			
	
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания = 4;
	Иначе
		ВремяОжидания = 2;
	КонецЕсли;
	
	ПараметрыЭкспортнойПроцедуры = Новый Массив;
	ПараметрыЭкспортнойПроцедуры.Добавить(Операция);
	ПараметрыЭкспортнойПроцедуры.Добавить(ПараметрыОбработки);
	ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилища);

	Задание = ФоновыеЗадания.Выполнить("ФоновыеЗаданияБухгалтерскийУчет.ВыполнитьОперациюОбменаССистемойУчетаИмущества",
										ПараметрыЭкспортнойПроцедуры,
										"Операция обмена с системой учета имущества");
	
	Попытка
		Задание.ОжидатьЗавершения(ВремяОжидания);
	Исключение		
		// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	КонецПопытки;
	
	ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	Возврат ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор);		
		
КонецФункции

 &НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка 
		
		Если ПроверитьВыполнениеФоновогоЗаданияНаСервере(ИдентификаторЗадания) Тогда									
			ВыполнитьПоЗавершениюДлительнойОперации(ТекущаяОперация);
			Возврат;
		КонецЕсли;
		
	Исключение
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение ОписаниеОшибки();
		
	КонецПопытки;	
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
	
КонецПроцедуры

 &НаСервереБезКонтекста
Функция ПроверитьВыполнениеФоновогоЗаданияНаСервере(ФоновоеЗаданиеИдентификатор)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПоЗавершениюДлительнойОперации(Операция)
	
	ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
	МассивСообщений = ПолучитьВсеСообщения(ИдентификаторЗадания);
	
	Если МассивСообщений <> Неопределено Тогда
		ОчиститьСообщения();
		Для Каждого Сообщение Из МассивСообщений Цикл
			Сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
		
	Если Операция = "ОбменДанными" Тогда
		
		ЗаданиеНаЭкспорт = ПолучитьИзВременногоХранилища(АдресХранилища);		
		Если ЗаданиеНаЭкспорт <> Неопределено Тогда			
			ЗаполнитьСписокДокументов();
			ФормаРезультат = ОткрытьФормуРезультата(ЗаданиеНаЭкспорт);				
		КонецЕсли;
		
	ИначеЕсли Операция = "ЗагрузитьДанные" Тогда
		
		ВывестиПолученныеДанные();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Загрузка сведений карт выполнена'"));
		
	ИначеЕсли Операция = "СоздатьКарты" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Карты созданы'"));
		
	ИначеЕсли Операция = "ЗагрузитьСправочники" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Классификаторы загружены'"));
		
	ИначеЕсли Операция = "ОбновитьСтатус" Тогда
		
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Статусы карт обновлены'"));
		
	ИначеЕсли Операция = "ОбновитьВсеСтатусы" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Статусы карт обновлены'"));	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВсеСообщения(ИдентификаторЗадания)
	
	МассивСообщений = Неопределено;
	
	Если Не ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		
		Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
		Если Задание <> Неопределено Тогда
			МассивСообщений = Задание.ПолучитьСообщенияПользователю();
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат МассивСообщений;

КонецФункции

&НаСервере
Процедура ВывестиПолученныеДанные()
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Для Каждого СтрокаТаблицы Из Результат Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ОбъектУчетаИмущества) Тогда
			СтрокаТаблицы.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Результат, "ДанныеКарт");				
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсииКартПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//Если Элементы.ВерсииКарт.ТекущиеДанные <> Неопределено Тогда
	//	Если Элементы.ВерсииКарт.ТекущиеДанные.ПометкаУдаления Тогда
	//		ДанныеЗаполнения = Новый Структура("ОбъектУчета,Организация", Элементы.ВерсииКарт.ТекущиеДанные.ОбъектУчета, Организация);
	//		Если Элементы.ОбъектыУчета.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элементы.ОбъектыУчета.ТекущиеДанные.ВидКарты) Тогда
	//			ДанныеЗаполнения.Вставить("ВидКарты", Элементы.ОбъектыУчета.ТекущиеДанные.ВидКарты);
	//		ИначеЕсли Элементы.ВидыКартСписок.ТекущиеДанные <> Неопределено И Не Элементы.ВидыКартСписок.ТекущиеДанные.ЭтоГруппа Тогда
	//			ДанныеЗаполнения.Вставить("ВидКарты", Элементы.ВидыКартСписок.ТекущиеДанные.Ссылка);
	//		КонецЕсли;
	//		ПараметрыФормы = Новый Структура("Основание", ДанныеЗаполнения);
	//	Иначе
	//		ПараметрыФормы = Новый Структура("Основание", Элементы.ВерсииКарт.ТекущиеДанные.Ссылка);
	//	КонецЕсли;
	//ИначеЕсли Элементы.ОбъектыУчета.ТекущиеДанные <> Неопределено Тогда
	//	ПараметрыФормы = Новый Структура("Основание", Элементы.ОбъектыУчета.ТекущиеДанные.ОбъектУчета);
	//Иначе
	//	ПараметрыФормы = Неопределено;
	//КонецЕсли;
	//
	//Если ПараметрыФормы <> Неопределено Тогда 		
	//	ОткрытьФорму("Документ.РегистрацияСведенийОбИмуществе.ФормаОбъекта", ПараметрыФормы);	
	//КонецЕсли;
	
	Отказ = Истина;
	
	Если Элементы.ОбъектыУчета.ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Основание", Элементы.ОбъектыУчета.ТекущиеДанные.ОбъектУчетаИмущества);
		ОткрытьФорму("Документ.РегистрацияСведенийОбИмуществе.ФормаОбъекта", ПараметрыФормы);
	Иначе
		ТекстОповещения = НСтр("ru = 'Создать новую редакцию'");
		Пояснение = НСтр("ru = 'Не выбран объект учета'");
		ПоказатьОповещениеПользователя(ТекстОповещения,, Пояснение);	
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ВидимостьВерсийКарт(Команда)
	
	Элементы.ВерсииКарт.Видимость = Не Элементы.ВерсииКарт.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыКартСписокПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборПоВидуКарты(Элемент);
	
	//ТекущиеДанные = Элемент.ТекущиеДанные;
	//ВидКарты = ?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.Ссылка);
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОбъектыУчета, "ВидКарты", ВидКарты, ВидСравненияКомпоновкиДанных.ВИерархии);
	//
	//Элементы.ОбъектыУчетаВидКарты.Видимость = ?(ТекущиеДанные = Неопределено, Истина, ТекущиеДанные.ЭтоГруппа);
	
	УстановитьОтборПоОбъектуУчетаИмущества(Элементы.ОбъектыУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоВидуКарты(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	//ВидКарты = ?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.Ссылка);
	Если ТекущиеДанные = Неопределено Тогда 
		ВидКарты = Неопределено;
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Иначе
		ВидКарты = ТекущиеДанные.Ссылка;
		ЭтоГруппа = ТекущиеДанные.ЭтоГруппа;
		пВидСравнения = ?(ЭтоГруппа, ВидСравненияКомпоновкиДанных.ВИерархии, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОбъектыУчета, "ОбъектУчетаИмущества.ВидКарты", ВидКарты, пВидСравнения);
	
	Элементы.ОбъектыУчетаВидКарты.Видимость = ?(ТекущиеДанные = Неопределено, Истина, ТекущиеДанные.ЭтоГруппа);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыУчетаПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборПоОбъектуУчетаИмущества(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоОбъектуУчетаИмущества(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		//ОтборОбъектУчета = ПредопределенноеЗначение("Справочник.ОсновныеСредства.ПустаяСсылка");
		//ОтборВидКарты = ПредопределенноеЗначение("Справочник.ВидыКартСведенийОбИмуществе.ПустаяСсылка");
		ОтборОбъектУчетаИмущества = ПредопределенноеЗначение("Справочник.ОбъектыУчетаСистемыУчетаИмущества.ПустаяСсылка");
	Иначе
		//ОтборОбъектУчета = Элемент.ТекущиеДанные.ОбъектУчета;
		//ОтборВидКарты = Элемент.ТекущиеДанные.ВидКарты;
		ОтборОбъектУчетаИмущества = Элемент.ТекущиеДанные.ОбъектУчетаИмущества;
	КонецЕсли;
	
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ВерсииКарт, "ОбъектУчета", ОтборОбъектУчета);	
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ВерсииКарт, "ВидКарты", ОтборВидКарты);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ВерсииКарт, "ОбъектУчетаИмущества", ОтборОбъектУчетаИмущества);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьДействующуюРедакцию();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДействующуюРедакцию()
	
	Если Элементы.ОбъектыУчета.ТекущиеДанные <> Неопределено Тогда		
		ДействующаяРедакция = Элементы.ОбъектыУчета.ТекущиеДанные.ДействующаяРедакция;
		Если ЗначениеЗаполнено(ДействующаяРедакция) Тогда
			ПоказатьЗначение(, ДействующаяРедакция);
		Иначе
			ТекстОповещения = НСтр("ru = 'Открыть карту'");
			Пояснение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'У объекта учета имущества ""%1"" отсутсвует действующая редакция карты'"), Строка(Элементы.ОбъектыУчета.ТекущиеДанные.ОбъектУчетаИмущества));
			ПоказатьОповещениеПользователя(ТекстОповещения,, Пояснение);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТолькоНеподтвержденныеРедакции(Команда)
	
	НеподтвержденныеРедакцииПометка = Не Элементы.ВерсииКартНеподтвержденныеРедакции.Пометка;
	ТолькоНеподтвержденныеРедакцииКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоНеподтвержденныеРедакцииКлиент()
	
	Элементы.ВерсииКартНеподтвержденныеРедакции.Пометка = НеподтвержденныеРедакцииПометка;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ВерсииКарт, "НеподтвержденнаяРедакция", Истина,,, НеподтвержденныеРедакцииПометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтивМП(Команда)
	
	ПараметрыФормы = Новый Структура("АдресСтраницы, Заголовок", "https://esugi.rosim.ru", "Модуль правообладателя");	
	ОткрытьФорму("ОбщаяФорма.Обозреватель", ПараметрыФормы);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыНастройкиОбмена(НастройкаОбмена)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаОбмена, "ВидОбмена");	
	
КонецФункции

&НаКлиенте
Процедура ДанныеКартПометкаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ДанныеКарт.ТекущиеДанные; 
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ОбъектУчетаИмущества) Тогда
		ТекущиеДанные.Пометка = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКартОбъектУчетаИмуществаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДанныеКарт.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ОбъектУчетаИмущества) Тогда
		
		ТекстОповещения = НСтр("ru = 'Выбор объекта учета имущества'");
		Пояснение = НСтр("ru = 'Объект учета уже выбран. Изменение объекта учета имущества невозможно'");
		ПоказатьОповещениеПользователя(ТекстОповещения,, Пояснение);
		
	Иначе
		
		Данные = Новый Структура("Организация,ВидКарты,Идентификатор,ОбъектУчета", Организация);
		ЗаполнитьЗначенияСвойств(Данные, ТекущиеДанные);
		
		ПараметрыФормы = Новый Структура("Основание", Данные);
		ОткрытьФорму("Обработка.ОбменССистемойУчетаИмущества.Форма.ФормаОбъектаУчетаИмущества", ПараметрыФормы, Элемент);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКартОбъектУчетаИмуществаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКартОбъектУчетаИмуществаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Элементы.ДанныеКарт.ТекущиеДанные.Пометка = Истина;
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаСоздатьОбъектыУчетаИмущества(Команда)
	
	ОчиститьСообщения();
	//Попытка
		Ошибки = ЗагрузкаСоздатьОбъектыУчетаИмуществаНаСервере();
	//Исключение
	//	ТекстСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	//	Предупреждение(НСтр("ru = 'Операция не может быть выполнена по причине:'") + Символы.ПС + ТекстСообщения);
	//КонецПопытки;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);

КонецПроцедуры

&НаСервере
Функция ЗагрузкаСоздатьОбъектыУчетаИмуществаНаСервере()

	Ошибки = Неопределено;
	
	//РеквизитФормыВЗначение("ДанныеКарт")
	
	Для Каждого СтрокаТаблицы Из ДанныеКарт Цикл		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ОбъектУчетаИмущества) И ЗначениеЗаполнено(СтрокаТаблицы.ОбъектУчета) Тогда
			
			ОбъектУИ = Справочники.ОбъектыУчетаСистемыУчетаИмущества.СоздатьЭлемент();
			ОбъектУИ.Организация = Организация;
			
			ЗаполнитьЗначенияСвойств(ОбъектУИ, СтрокаТаблицы, "ОбъектУчета,ВидКарты,Идентификатор");
			
			Попытка
				ОбъектУИ.Записать();
				СтрокаТаблицы.ОбъектУчетаИмущества = ОбъектУИ.Ссылка;
				СтрокаТаблицы.Пометка = Истина;
			Исключение
				// Сообщаем: в строке № не удалось создать объект учета имущества (ссылка на строку)
				ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				//ПоказатьИнформациюОбОшибке(Инфо);
				//ВызватьИсключение ;
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка,,, Отказ);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ДанныеКарт[%1].ОбъектУчетаИмущества", ТекстОшибки, "", ДанныеКарт.Индекс(СтрокаТаблицы));
			КонецПопытки;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ошибки;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСтатусыЗапросов(Команда)
	
	ДокументыЗапросы = Элементы.ВерсииКарт.ВыделенныеСтроки;

	Если ДокументыЗапросы.Количество()> 0 Тогда
		ДопПараметры = Новый Структура("Документы", ДокументыЗапросы);
		ВыполнитьДлительнуюОперацию("ОбновитьСтатусыЗапросов", ДопПараметры);		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыКарт(Команда)
	
	ОбъектыУчетаИмущества = Новый Массив;
	Для Каждого Строка Из Элементы.ОбъектыУчета.ВыделенныеСтроки Цикл
		ОбъектыУчетаИмущества.Добавить(Строка.ОбъектУчетаИмущества);
	КонецЦикла;
	
	Если ОбъектыУчетаИмущества.Количество()> 0 Тогда
		ДопПараметры = Новый Структура("ОбъектыУчетаИмущества", ОбъектыУчетаИмущества);
		ВыполнитьДлительнуюОперацию("ОбновитьСтатусыКарт", ДопПараметры);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦвета()
	
	Цвета = Новый Структура;
	Цвета.Вставить("ПоясняющийТекст", ЦветаСтиля.ПоясняющийТекст);
	Цвета.Вставить("ПоясняющийОшибкуТекст", ЦветаСтиля.ПоясняющийОшибкуТекст);
	
	Возврат Цвета;
	
КонецФункции

#КонецОбласти

Цвета = ПолучитьЦвета();
